Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/arkivverket.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: The map is studied before a raid over France.
nn: Kartstudier før eit tokt over Frankrike.

source: In May 1941, a holiday and recreational estate for the air force personnel was purchased.
nn: I mai 1941 blei det kjøpt ein ferie- og rekreasjonseigedom for flyvåpenet sitt personell.

source: Except from squadron 333, the administrative archives of the other squadrons are for the time being not available for search in the directory.
nn: Med unnatak av 333 skvadron, er sakarkiva etter dei andre skvadronane førebels ikkje tilgjengelege for søking i felleskatalogen.

source: After restoring an old timber building, and building of a new one, the estate could house 150 men.
nn: Etter restaurering av ein gammal tømmerbygning og bygging av ein ny, hadde staden plass til 150 mann.

source: In total 334 Norwegian pilots were killed during the war.
nn: Til saman miste 334 norske flygarar livet under krigen.

source: Neither is the archive of the Department of Defense in London.
nn: Det er heller ikkje arkivet etter Forsvarsdepartementet i London.

source: In the 333 squadron’s other material you can find letters, authorization books, order books for flying, logbooks for airplanes and crew, administrative archive and watch journals.
nn: I 333 skvadron sitt arkiv finn ein elles brev, autorisasjonsbøker, ordrebøker for flyging, loggbøker for fly og besetningar, sakarkiv og vaktprotokollar.

source: In the archive of squadron 333 there are several reports from air raides.
nn: I arkivet etter 333 skvadron finst det fleire rapportar frå flytokt.

source: The Air Force joint command was established in March 1941 with Hjalmar Riiser-Larsen as the leader.
nn: Flyvåpena sin felleskommando blei oppretta i mars 1941 med Hjalmar Riiser-Larsen som sjef.

source: The air force training camp was officially opened November 10th 1940.
nn: Flyvåpena sin treningsleir blei offisielt opna 10. november 1940.

source: Relevant archives in Arkivportalen
nn: Relevante arkiv i Arkivportalen

source: Squadron 330 (the first squadron) was established in 1941 with a base on Iceland.
nn: 330 skvadron (den første skvadronen) blei oppretta i 1941 med base på Island.

source: Then followed squadron 332 and squadron 333, which were localized at Woodhaven in Scotland.
nn: Sidan følgde 332 skvadron og 333 skvadron som var lokaliserte ved Woodhaven i Skottland.

source: Major Ole Reistad became in charge of the training centre ”Little Norway” in Toronto.
nn: Major Ole Reistad blei sjef for treningssenteret ”Little Norway” i Toronto.

source: In the Legation in Bern’s archive there is correspondence about missing Norwegian pilots in series D, box 63.
nn: I arkivet etter legasjonen i Bern er det korrespondanse om sakna norske flygarar i serie D, eske 63.

source: In the summer of 1940, Lieutenant Commander Hjalmar Riiser-Larsen was appointed leader of the Navy’s air force, and Bjarne Øen for the Army’s air force in Canada.
nn: Sommaren 1940 blei kapteinløytnant Hjalmar Riiser-Larsen utnemnd til sjef for Marinens flyvevåpen, og Bjarne Øen for Hærens flyvevåpen i Canada.
